Управление_пожарной_частью_/src/Documents/Поступления/Поступления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поступления</name>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/AccumulationRegisters/Остатки/Остатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Остатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/Documents/Поступления/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество Из ВещевоеИмущество Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
